#pragma once

#ifndef GAME_HPP
#define GAME_HPP

//===========================
//библиотеки stl которые вам могу быть нужны


//===========================
#include "Toy.hpp"
#include "Frame.hpp"

class Game {
	//to-do: надо сделать игру
};


#endif // !GAME_HPP
//ѕравила игры:
// ¬ ведЄрке при содании есть некоторое количество 
// игрушек(хран€тс€ в коллекции)
// ” ведЄрка при создании должно быть некоторое количество рамок 
// дл€ продевани€ игрушек(тоже можно в коллекцию засунуть)
// игрок может видеть что он вз€л из ведЄрка
// игрок может попробовать засунуть в какую нибудь рамку игрушку из руки
// если рамка не позвол€ет продеть игрушку то она остаЄтс€ у игрока
//